# Customer Shared - Staging
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
./src/customer/shared/infrastructure/workspaces/staging relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/Connectilly/Connectilly/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/Connectilly/Connectilly

To view this run in a browser, visit:
https://app.terraform.io/app/Connectilly/customer-shared-staging/runs/run-CoEcDcRpfiKwo78o

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
module.database.cockroach_cluster.default: Refreshing state... [id=bfad5b64-2446-46f4-88c1-08ea8a31671a]
module.database.cockroach_database.default: Refreshing state... [id=bfad5b64-2446-46f4-88c1-08ea8a31671a:customer]
module.database.aws_ssm_parameter.default: Refreshing state... [id=customer-shared-staging-customer-cluster-id]
module.database_user.data.aws_ssm_parameter.cluster_id: Refreshing...
module.database_user.random_password.password: Refreshing state... [id=none]
module.database_user.data.aws_ssm_parameter.cluster_id: Refresh complete after 1s [id=customer-shared-staging-customer-cluster-id]
module.database_user.cockroach_sql_user.default: Refreshing state... [id=bfad5b64-2446-46f4-88c1-08ea8a31671a:customer-shared]
module.database.cockroach_database.default: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "customer"
      + id                = "bfad5b64-2446-46f4-88c1-08ea8a31671a"
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = (known after apply)
    }

  # module.database_user.cockroach_sql_user.default must be replaced
-/+ resource "cockroach_sql_user" "default" {
      ~ id         = "bfad5b64-2446-46f4-88c1-08ea8a31671a:customer-shared" -> (known after apply)
      ~ name       = "customer-shared" # forces replacement -> (known after apply)
      ~ password   = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.database_user.random_integer.username_suffix will be created
  + resource "random_integer" "username_suffix" {
      + id     = (known after apply)
      + max    = 50000
      + min    = 1
      + result = (known after apply)
    }

  # module.database_user.random_password.password must be replaced
-/+ resource "random_password" "password" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      - keepers          = { # forces replacement
          - "random_seed" = "50b8b1b9-07a7-44e3-aed0-42e1e96825a6"
        } -> null
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

Plan: 3 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ customer_database_connection_string = (sensitive value)

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*